### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.postgres.module.cms_postgres_flexible_server.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-svc-cms-psql-01"
      + notes      = "Locked via Terraform"
      + scope      = (known after apply)
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-CPU_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_monitor_metric_alert.this["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-svc-cms-psql-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_postgresql_flexible_server.this must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ administrator_login               = (sensitive value)
      + administrator_password            = (sensitive value)
      - administrator_password_wo_version = 0 -> null
      ~ auto_grow_enabled                 = false -> true
      + create_mode                       = "Default"
      - delegated_subnet_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-pgres-snet-01" -> null # forces replacement
      ~ fqdn                              = "io-p-itn-svc-cms-psql-01.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.DBforPostgreSQL/flexibleServers/io-p-itn-svc-cms-psql-01" -> (known after apply)
        name                              = "io-p-itn-svc-cms-psql-01"
      ~ private_dns_zone_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com" -> (known after apply)
      ~ storage_tier                      = "P4" -> (known after apply)
      ~ tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
          ~ "Source"         = "https://github.com/pagopa/io-services-cms" -> "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      - zone                              = "3" -> null
        # (9 unchanged attributes hidden)

      ~ authentication (known after apply)
      - authentication {
          - active_directory_auth_enabled = false -> null
          - password_auth_enabled         = true -> null
            # (1 unchanged attribute hidden)
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_postgresql_flexible_server_configuration.pgbouncer[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgbouncer" {
      + id        = (known after apply)
      + name      = "pgbouncer.enabled"
      + server_id = (known after apply)
      + value     = "true"
    }

  # module.postgres.module.cms_postgres_flexible_server.azurerm_private_endpoint.postgre_pep will be created
  + resource "azurerm_private_endpoint" "postgre_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-cms-psql-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-cms-psql-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.postgres.module.pgres_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.16.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-svc-pgres-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "dlg-Microsoft.DBforPostgreSQL-flexibleServers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # module.postgres_snet.module.pgres_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                              = [
          - "10.20.16.0/24",
        ] -> null
      - default_outbound_access_enabled               = true -> null
      - id                                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-pgres-snet-01" -> null
      - name                                          = "io-p-itn-svc-pgres-snet-01" -> null
      - private_endpoint_network_policies             = "Disabled" -> null
      - private_link_service_network_policies_enabled = true -> null
      - resource_group_name                           = "io-p-itn-common-rg-01" -> null
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
      - virtual_network_name                          = "io-p-itn-common-vnet-01" -> null
    }

Plan: 10 to add, 0 to change, 2 to destroy.
```

</details>
